---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FloorStructureIdParam
source: html/d43df79b-daae-430a-6107-8830f6b23a28.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FloorStructureIdParam Property

"Structure"

## Syntax (C#)
```csharp
public static ForgeTypeId FloorStructureIdParam { get; }
```